# Polyloop Properties

---
The Polyloop type exposes the following members.
| Name| Description
---|---|---
| Centroid|  The polygon centroid.
| Direction|  The direction for the outward normal for this polygon.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace